function f_show_ex_all(){
	f_show_ex1_3456();
	f_show_ex2();
	f_show_ex3();
      
	document.getElementById("tab4_1").innerText = ""; 
	document.getElementById("tab4_2").innerText = ""
	f_show_ex4_1() ;
	f_show_ex4_2();	
	f_cal_4_3('tab4_3');
	f_show_ex4_4('tab4_4');
	
}

//********************************************************************
// ตัวอย่าง
//********************************************************************
function f_show_ex1_3456(){
	
	
				 document.getElementById("tab1_brn_code").innerText = "344" ;
				 document.getElementById("tab1_prov_code").innerText = "9040" ;
				 document.getElementById("tab1_prov_name").innerText = "สนจ.บุรีรัมย์" ;
				 document.getElementById("tab1_brn_name").innerText = "สาขาลำปลายมาศ" ;
				 document.getElementById("tab1_meet_no").innerText = "55" ;
				 
				 document.getElementById("tab1_name").innerText = "นายทดสอบ ตัดหนี้สูญ" ;
				 document.getElementById("tab1_age").innerText = "75" ;
				 document.getElementById("tab1_cid").innerText = "11111-1111111-1" ;
				 document.getElementById("tab1_group").innerText = "20" ;
				 document.getElementById("tab1_cif").innerText = "555" ;
				 document.getElementById("tab1_em_name_tel").innerText = "นายกฤษดา ทั่วประโคน 0878065707" ;	
				 
				 document.getElementById("tab1_status").innerText = "ป่วย" ;
				 document.getElementById("tab1_debt_servant").innerText = "" ;
				 document.getElementById("tab1_job").innerText = "เลิกประกอบอาชีพ" ;
				 document.getElementById("tab1_income").innerText = "" ;
				 document.getElementById("tab1_asset").innerText = "" ;	
				 
				   // ตารางหนี้
				var tb = document.getElementById("tb_loan") ;
				f_table_delete_all_row("tb_loan");
				
				f_table_add_row("tb_loan",18);
				f_table_add_row("tb_loan",18);
				var str = "1|536138054318|เงินทุนหมุนเวียน|โครงการปกติของธนาคาร|18 ม.ค. 2548|ลน.ร่วม,คนค้ำ|18,000.00||||||||18,000.00|20,005.01|19";
				str = str.replaceAll("#","\n");
				var cols = str.split("|") ;
				for(var i = 1 ; i < cols.length ; i++){
					tb.rows[3].cells[i].innerText = cols[i] ;
				}
				var str = "1|536138888888|เงินทุนหมุนเวียน|โครงการปกติของธนาคาร|18 ม.ค. 2548|ลน.ร่วม,คนค้ำ|18,000.00||||||||10,000.00|10,005.02|19";
				str = str.replaceAll("#","\n");
				var cols = str.split("|") ;
				for(var i = 1 ; i < cols.length ; i++){
					tb.rows[4].cells[i].innerText = cols[i] ;
				}	
				f_meet_full();
}

//*********************************************************************************************
//  2
//*********************************************************************************************
function f_show_ex2(){
				//1.3 ไม่ขาดอายุความ แบบสั้น(PPT)
				document.getElementById("tab2_1_3").innerText = "ชำระหนี้บางส่วน 21 ธันวาคม 25.......... " ;
				
				//1.4 ไม่ขาดอายุความ แบบละเอียด(WORD)
				var str = "<u>ตัวอย่าง 1</u>";
				str=str+"<br> ทําบันทึกข้อตกลง ต่อท้ายพักชําระหนี้ 22 กันยายน 25.......... ";
				str=str+"<br> และชำระบางส่วนทั้งสองสัญญาเมื่อวันที่ 21 ธันวาคม 25.......... " ; 
				str=str+"<br> (เงินจาก ฌาปนกิจสงเคราะห์) "; 
				str=str+"<br> ";
				str=str+"<br> <u>ตัวอย่าง 2</u>";
				str=str+"<br> จากชําระหนี้ 11 มีนาคม 2535 , 3 กันยายน 2539 , 11 สิงหาคม 2540 ทํารชน.(ตนเอง) 10กันยายน 2556  ";
				str=str+"<br> และชำระบางส่วนทั้งสองสัญญาเมื่อวันที่ 21 ธันวาคม 25...... (เงิน ฌาปนกิจสงเคราะห์) ";
				str=str+"<br><br> ";
				str=str+ " <u>ตัวอย่าง 3กรณีตาย</u>";
				str=str+"<br> ผู้อื่น รชน.เมื่อ 11 กันยายน 25.......... "; 
				str=str+"<br><br> ";		
				document.getElementById("tab2_1_4").innerHTML = str;
				
				//1.5 ไม่ดำเนินคดีและบังคับคดีเนื่องจาก
				var str="ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย";
				str=str+"<br> หากจะฟ้องผู้กู้และลูกหนี้ร่วม/ผู้ค้ำประกัน";
				str=str+"<br><br> ";		
				document.getElementById("tab2_1_5").innerHTML = str  ;		
				
				//2.1 กู้เงิน ปี...เพื่อ...(กฎกระทรวง186)
				var str="<u>ตัวอย่าง 1 </u>";
				str=str+"<br>  ปี 2540-2541 กู้เงินเพื่อเป็นค่าใช้จ่ายในการทำนาเช่า 16 ไร่และซื้อวัวแม่พันธุ์ 5 ตัว";
				str=str+"<br> ";
				str=str+"<br> <u>ตัวอย่าง 2</u>";
				str=str+"<br>  เป็นหนี้ซึ่งเกิดจากการรับใช้หนี้แทนบิดา ที่ตาย ซึ่งกู้เงินปี 2540-2541เพื่อทํานาข้าว";
				str=str+"<br><br> ";		
				document.getElementById("tab2_2_1").innerHTML = str ;
				
				//2.2 ชำระหนี้ไม่ได้เนื่องจาก
				var str="<u>ตัวอย่าง 1</u>";
				str=str+"<br> ประสบภาวะฝนแล้งติดต่อกันหลายปี ได้ขายวัวชำระหนี้บางส่วน ที่เหลือนำเงินมาเป็นค่าใช้จ่ายในครอบครัว ";
				str=str+"<br> ต่อมาธนาคารให้การช่วยเหลือโดย ปรับปรุงโครงสร้างหนี้ ";
				str=str+"<br> แต่ชำระหนี้ไม่ได้เนื่องจากคู่สมรสเสียชีวิตโดยไม่ได้สมัครสมาคมฌาปนกิจฯ มีค่าใช้จ่ายสูง  ";
				str=str+"<br><br> ";
				str=str+"<u>ตัวอย่าง 2 (กรณี รชน : บันทึกในระบบแล้ว)</u>";
				str=str+"<br> ประสบปัญหามีค่ารักษาพยาบาลตนเองซึ่งป่วยเป็นโรคมะเร็ง  ";	
				str=str+"<br> ส่วนผู้รับใช้หนี้เข้าทํารับใช้หนี้ขณะเลิกประกอบอาชีพการเกษตรทําให้ ไม่มีรายได้พอชําระหนี้ได้";
				str=str+"<br><br> ";		
				document.getElementById("tab2_2_2").innerHTML = str ;
				
				
				//3.1 สภาพร่างกาย/การเจ็บป่วย)
				var str="<u>ตัวอย่าง 1</u>";
				str=str+"<br>ป่วยด้วยอาการปวดมือและขาขวา จากการผ่าตัดใส่เหล็กดาม เนื่องจากอุบัติเหตุถูกรถชนต้องกินยาแก้ปวดทุกวัน ";
				str=str+"<br><br> ";
				str=str+"<u>ตัวอย่าง 2</u> <br>  เป็นสมาชิกกองทุนฟื้นฟู กลุ่ม 1 เสียชีวิตเมื่อวันที่ .............ด้วยโรคหอบหืด";
				str=str+"<br>   << กรณีตายให้ระบุปีที่ตายด้วย > ";
				str=str+"<br><br> ";	
				document.getElementById("tab2_3_1").innerHTML = str ;
				
				
				//3.2 ประกอบอาชีพ
				var str="<u>ตัวอย่าง 1</u><br>  มีอาชีพรับจ้างทั่วไปรายวัน รายได้พอยังชีพ ";
				str=str+"<br><br> ";
				str=str+"<u>ตัวอย่าง 2</u> <br> เลิกประกอบอาชีพ อาศัยอยู่กับลูก (กรณีนี้ส่วนใหญ่ อายุมากหรือป่วย ในรายการทรัพย์สิน : ไม่มีทรัพย์สิน อาศัยอยู่กับลูก) ";
				str=str+"<br><br> ";	
				document.getElementById("tab2_3_2").innerHTML = str ;
				
				
				//3.3 ทรัพย์สิน เน้นบ้าน ที่อาศัย ที่ดิน
				var str="<u>ตัวอย่าง 1</u> <br>  บ้าน 1 หลัง ไม่มีมูลค่า ปลูกในที่ไม่มีเอกสารสิทธิ์ ";
				str=str+"<br><br> ";
				str=str+"<u>ตัวอย่าง 2</u><br>  ไม่มีทรัพย์สิน อาศัยอยู่กับลูก";
				str=str+"<br><br> ";
				str=str+"<u>ตัวอย่าง 3</u><br> บ้าน 1 หลัง ไม่มีมูลค่า ปลูกในที่ของผู้อื่น";
				str=str+"<br><br> ";	
				document.getElementById("tab2_3_3").innerHTML = str ;	
		 
}


//************************************************************************
//  3
//************************************************************************

 /* 
 มีทรัพย์สินบ้านไม้ 1 หลัง ไม่มีมูลค่าปลูกบนที่ดินไม่มีเอกสารสิทธ์ มีหนี้ ธ.ก.ส.(บุคคล,ลน.ร่วม) 
 ต้นเงิน (ค้าง)85,000 บาท ดอกเบี้ย 10,985 บาท กทบ.20,000บาท 
 */
 
function f_show_ex3(){		
		// #  บรรทัดใหม่ ใน เซลล์
		var str = "" ; 
		str = str + "@1|1|นายหนึ่ง$นามสกุลสมมุติ|ตาย|||||||||||||ลบ|";
		str = str + "@2|1|นางสอง$นามสกุลสมมุติ(เสนอตัดหนี้สูญ)|75|ป่วยเป็นอัมพฤกษ์ซีกซ้าย|เลิกประกอบอาชีพอาศัยบุตรเลี้ยงดู|||||ค้าง|ลน.ร่วม,คนค้ำ|30,000.00|30,461.00|กทบ.5,000บาท|50,00|ลบ|"; 
		str = str + "@3|1|นายสาม$กรณีป่วยรับจ้าง|48|ป่วยเป็นโรคไทรอยด์|รับจ้าง|10,000.00||บ้านไม้$1$หลัง$ไม่มีมูลค่า$ปลูกบนที่ดินไม่มีเอกสารสิทธ์||ค้าง|คนค้ำ,ลน.ร่วม|85,000.00|10,985.00|กทบ.20,000บาท|20,000.00|ลบ|"; 
		str = str + "@4|1|นายสี่$นามสกุลสมมุติ|64||ทำนาเช่า$5ไร่|5,000.00||ไม่มีอาศัยบ้านบุตรสาว||ปปน.(ค้าง)|คนค้ำ,ลน.ร่วม|100,000.00|62,075.00|กทบ.10,000บาท|010.00|ลบ|"; 
		str = str + "@5|1|นายห้า$นามสกุลสมมุติ|43|ย้ายถิ่นที่อยู่|รับจ้างสวนยางพารา|||ไม่มี$อาศัยอยู่กับพ่อตาที่จังหวัดนครศรีธรรมราช||||||||ลบ|"; 
		str = str + "@6|1|นางหก$นามสกุลสมมุติ|58||ค้าขาย|40,000.00||บ้านไม้$1$หลัง$$มูลค่า$10,000$บาทปลูกบนที่ดินตนเอง$#เนื้อที่$-/3/35(จำนอง$ธ.ก.ส.$วงเงิน$83,000$$บาท)#รถยนต์$1$คัน$มูลค่า$100,000$บาท|193,000.00|ปปน.|คนค้ำ,ลน.ร่วม|150,000.00|2,324.00|กทบ.10,000บาท|10,000.00|ลบ|"; 
		str = str + "@7|1|นายเจ็ด$นามสกุลสมมุติ|57||รับจ้าง|10,000.00||บ้านไม้$1$หลัง$ไม่มีมูลค่าปลูกบนที่ดินตนเอง$เนื้อที่$-/1/-$#(ที่ดินฝากนายทุน)$มูลค่า$50,000$บาท|50,000.00|ปปน.|คนค้ำ,ลน.ร่วม|75,000.00|520.00|กทบ10,000บาท#นายทุนในหมู่บ้าน$10,000บาท|20,000.00|ลบ|"; 
		str = str + "@8|1|นายแปด$นามสกุลสมมุติ|57||รับจ้าง|25,000.00||บ้านไม้$1$หลัง$มูลค่า$10,000บาท$#ปลูกบนที่ดินตนเอง$เนื้อที่$-/-/75$ไร่$มูลค่า$45,000$บาท|55,000.00|||||กทบ.10,000บาท|10,000.00|ลบ|"; 
		str = str + "@9|1|นายเก้า$นามสกุลสมมุติ|45||ทำนา20ไร่(เช่า15ไร่)|30,000.00|ดูแลแม่$อายุ70ปีป่วยติดเตียง|บ้านปูน$1$หลังสภาพเก่า$ไม่มีมูลค่า#ปลูกบนที่ดินตนเองเนื้อที่$-/1/-#(จำนองธ.ก.ส.วงเงิน$30,000บาท)#ที่นา5ไร่(จำนองธ.ก.ส.วงเงิน$100,000บาท)|130,000.00|ปปน.|จำนอง,ลน.ร่วม|150,000.00|10,000.00|กทบ$20,000บาท|20,000.00|ลบ|"; 
		str = str + "@10|1|นางสิบ$นามสกุลสมมุติ|47||นักการเมืองท้องถิ่นตำแหน่งสมาชิกเทศบาลสามีเป็นลูกจ้างชั่วคราวเทศบาล|50,000.00|ส่งบุตรเรียน$3$คน|(อาศัยบ้านมารดา)$รถจักรยานยนต์$3$คัน$มูลค่า$30,000$บาท|30,000.00|ค้าง|คนค้ำ,ลน.ร่วม|200,000.00|250,216.00|ธ.กรุงไทย|80,000.00|ลบ|"; 
		str = str + "@11|1|นายสิบเอ็ด$นามสกุลสมมุติ|57||ลูกจ้างโรงไฟฟ้าแม่เมาะ|30,000.00||บ้านไม้$1$หลัง$มูลค่า$100,000$บาทปลูกบนที่ดินภรรยา$เนื้อที่$-/2/78#(จำนอง$ธ.ก.ส.วงเงิน$10,000$บาท)#ที่สวนของภรรยา$2$เแปลง#1)$เนื้อที่$3/1/67$(จำนอง$ธ.ก.ส.วงเงิน$82,000$บาท)#2)$เนื้อที่$3/3/55$(จำนอง$ธ.ก.ส.วงเงิน$130,000$บาท)|362,000.00|ปปน.|คนค้ำ,ลน.ร่วม|130,000.00|2,276.00|สหกรณ์การไฟฟ้าแม่เมาะ$#1,000,000$บาท|1,000,000.00|ลบ|"; 
		str = str + "@12||||||||||||||||ลบ|"; 
		str = str + "@13|2|ลูกหนี้ร่วมลำดับ$2||||||||||||||ลบ|"; 
		str = str + "@14|2|ลูกหนี้ร่วมลำดับ$3||||||||||||||ลบ|"; 
		str = str + "@15|2|นางค้ำสาม$$นามสกุลสมมุติ|71|ป่วยกล้ามเนื้ออ่อนแรง|เลิกประกอบอาชีพอาศัยอยู่กับบุตร|||||||||||ลบ|"; 
		str = str + "@16|2|นายค้ำจตุพักตร$นามสกุลสมมุติ|57||รับจ้างทั่วไป|||บ้านไม้$1$หลัง$ไม่มีมูลค่า$$ปลูกบนที่ดินแม่ยาย||ปปน.|คนค้ำ,ลน.ร่วม|55,000.00|2,276.00|กทบ$10,000บาท|10,000.00|ลบ|"; 
		str = str + "@17||||||||||||||||ลบ|"; 
		 
		
		str = str.replaceAll("#","\n") ;
		str = str.replaceAll("$"," ") ;
		
		var rows = str.split("@") ;
		var tb = document.getElementById("tb_garantee") ; 
		var iStartRow  = 3 ;  // เริ่มบรรทัด0->3
		var iStartCol  = 0 ;
		f_table_delete_all_row("tb_garantee");
		var irow = iStartRow ;
		for(var r = 0 ; r < rows.length ; r++){
				if(rows[r] !== ""){ 
							f_table_add_row('tb_garantee',17);
							//console.log(rows[r]) ;
							var cols = rows[r].split("|") ;
							for(var c = 1 ; c < cols.length-1 ; c++){
								tb.rows[irow ].cells[c + iStartCol].innerText = cols[c] ;
							}	
							irow++;
				}
		}
}


//***************************************************************************
//  4
//***************************************************************************
//1.การติดตามหนี้ลูกค้า 
function f_show_ex4_1(){	
		var td = document.getElementById("tab4_1"); 
		var str = "<u>ตัวอย่างที่ 1</u>";
					str = str + "<br>ติดตามอย่างต่อเนื่องตั้งแต่ค้างชำระ ต่อมาปรับปรุงโครงสร้างหนี้แต่ไม่สามารถชำระได้";
					str = str + "<br>เนื่องจากรายได้น้อย ทำงานหนักไม่ได้ " ;
					str = str + "<br>ส่วนหนึ่งมาจากผลของอาการบาดเจ็บจากอุบัติเหตุถูกรถชนจนต้องใส่เหล็กดามที่มือและขาขวา";
					str = str + "<br>ไม่สามารถทำงานหนักได้ มีอาการปวดทุกวัน"; 
					str = str + "<br>จนต้องกินยาแก้ปวดทุกวัน หากวันไหนไม่กินจะปวดมาก บางเดือนถึงกับลุกไม่ขึ้นทำงานไม่ได้";
					str = str + "<br>บุตรชายที่อยู่ด้วยมีรายได้เพียงใช้จ่ายในครัวเรือน ไม่สามารถรับใช้หนี้ได้ ";
					str = str + "<br>";
					str = str + "<br><u>ตัวอย่างที่  2</u>";
					str = str + "<br> ติดตามตั้งแต่ค้างชำระ พบว่าลูกค้าเป็นสมาชิกกองทุนฟื้นฟูไม่สามารถชำระหนี้ได้";
					str = str + "<br>เนื่องจากนำเงินบางส่วนที่ได้จากการขายวัว เป็นค่ารักษาโรคหอบหืดของตนเอง ";
					str = str + "<br>ภรรยาอายุมาก เลิกประกอบอาชีพ บุตร 3 คน ต่างแยกครอบครัว มีภาระค่าใช้จ่ายของตนเอง";
					str = str + "<br>ไม่สามารถรับใช้หนี้ได้ ลูกค้าเสียชีวิตเมื่อวันที่..........";
					str = str + "<br>ทายาทจึงตัดสินใจนำเงินฌาปนกิจสงเคราะห์ฯ มาชำระ จำนวน 118,948 บาท ";
					str = str + "<br><br><br>";
		if(td.innerText == ""){
					td.innerHTML = str ;
					}else{ 
					if (confirm("การติดตามหนี้ลูกค้า<br> ----------------------------- <br> ต้องการ แสดงตัวอย่าง หรือไม่ ? ")) {
							td.innerHTML = str ;
					}					
		}					 
}

//2.การติดตามหนี้ ลน.ร่วมและผู้ค้ำ(2 ครั้งหลังเมื่อใด ผลเป็นอย่างไร)
function f_show_ex4_2(){	
			var td =  document.getElementById("tab4_2"); 
			var str = "<u>ตัวอย่างที่ 1</u>";
						str = str + "<br>ผู้ค้ำประกันได้ช่วยในการเร่งรัดทำให้ลูกค้าได้ขายวัวและนำเงินมาชำระหนี้เมื่อ.......... จำนวน 10,000 บาท ";
						str = str + "<br>ผู้ค้ำประกันต่างมีหนี้ตนเองกับ ธ.ก.ส.ที่เป็นภาระหนัก ไม่สามารถช่วยเฉลี่ยชำระหนี้ได้ ";
						str = str + "<br>ลูกค้าและผู้ค้ำประกันมีและไม่มีทรัพย์สินไม่คุ้มหากดำเนินคดีและบังคับคดี";

						str = str + "<br><br><u>ตัวอย่างที่ 2</u>";
						str = str + "<br>ติดตามเร่งรัดจากผู้ค้ำประกันพบว่า เสียชีวิต 1 คน ส่วนอีก 1 คน อายุมากกู้เงินโดยให้บุตรชำระแทน";
						str = str + "<br>มีทรัพย์สินของภรรยาเพื่ออยู่อาศัยและประกอบอาชีพ  ลูกหนี้ร่วมมีทรัพย์สินมูลค่าใกล้เคียงกับหนี้ ";
						str = str + "<br> ไม่สามารถช่วยเฉลี่ยชำระได้";
						str = str + "<br>สาขาได้ติดตามอย่างถึงที่สุด หากติดตามต่อไปไม่คุ้มค่าใช้จ่าย";

						str = str + "<br><br> <u>ตัวอย่างที่ 3</u>";
						str = str + "<br> ผู้ค้ำประกันได้รวบรวมเงินมาชำระแทนผู้กู้ เมื่อวันที่..........จำนวน..........บาท  ";
						str = str + "<br> แต่ไม่สามารถชำระหนี้แทนได้ทั้งสัญญา เนื่องจากมีรายได้เพียงเลี้ยงชีพ";
						str = str + "<br>และมีหนี้สินของตนเองเป็นภาระหนัก";		 
						str = str + "<br><br>";
						
			if(td.innerText == ""){
						td.innerHTML = str ;
						}else{ 
						if (confirm("การติดตามหนี้ ลน.ร่วมและผู้ค้ำ<br> ----------------------------- <br> ต้องการ แสดงตัวอย่าง หรือไม่ ? ")) {
								td.innerHTML= str ;
						}				
		}			
}

//3.ตัวอย่าง ความเห็น : สาขา
function f_show_ex4_3(id){	
		f_meet_full();
		var td = document.getElementById(id) ;
		var str = document.getElementById("tab1_meet_full").innerText ;
		str = str + " เห็นสมควรจำหน่ายทรัพย์สินประเภทลูกหนี้ออกจากบัญชีเป็นหนี้สูญเนื่องจาก";
		str = str + " เป็นหนี้ไม่ขาดอายุความ";
		str = str + " มีหลักฐานการเป็นหนี้พอฟ้องคดีได้ มีการติดตามหนี้ถึงที่สุด ไม่มีลู่ทางชำระหนี้ได้ ";
		str = str + " ไม่ฟ้องหรือดำเนินคดีเนื่องจากหากจะฟ้องผู้กู้และลูกหนี้ร่วม/ผู้ค้ำประกัน";
		str = str + " ผู้กู้ไม่มีทรัพย์สิน  ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย";
		str = str + " ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย";
		str = str + "<br><br>";
		str = str + "<u>ตัวอย่างที่  1</u><br>ผู้ค้ำประกันได้ช่วยในการเร่งรัดจนลูกค้าได้ขายวัวและนำเงินมาชำระหนี้เมื่อ 30 ก.ย.2553 (10,000 บาท)";
		str = str + " ผู้ค้ำประกันต่างมีหนี้ตนเองกับ ธ.ก.ส.ที่เป็นภาระหนัก ไม่สามารถช่วยเฉลี่ยชำระหนี้ได้";
		str = str + " ลูกค้าและผู้ค้ำประกันมีและไม่มีทรัพย์สินไม่คุ้มหากดำเนินคดีและบังคับคดี";
		str = str + "<br><br>";
		str = str + "<u>ตัวอย่างที่  2</u><br> ติดตามเร่งรัดจากผู้ค้ำประกันพบว่า เสียชีวิต 1 คน ส่วนอีก 1 คน อายุมากกู้เงินโดยให้บุตรชำระแทน";
		str = str + " มีทรัพย์สินของภรรยาเพื่ออยู่อาศัยและประกอบอาชีพ  ลูกหนี้ร่วมมีทรัพย์สินมูลค่าใกล้เคียงกับหนี้  ไม่สามารถช่วยเฉลี่ยชำระได้";
		str = str + " สาขาได้ติดตามอย่างถึงที่สุด หากติดตามต่อไปไม่คุ้มค่าใช้จ่าย";
		str = str + "<br><br>";
		str = str + "<u>ตัวอย่างที่  3</u><br>ผู้ค้ำประกันได้รวบรวมเงินมาชำระแทนผู้กู้จำนวน xxx เมื่อวันที่ แต่ไม่สามารถชำระหนี้แทนได้ทั้งสัญญา เนื่องจากมีรายได้เพียงเลี้ยงชีพ";
		str = str + " และมีหนี้สินของตนเองเป็นภาระหนัก";
		str = str + " และเห็นควรเสนอคณะกรรมการบริหารหนี้ค้างชำระ ระดับสำนักงาน ธ.ก.ส. จังหวัด พิจารณาดำเนินการ ต่อไป";
		str = str + "<br><br>";
		td.innerHTML = str ;


}		


//4.ความเห็น : สนจ.
function f_show_ex4_4(id){	
		//f_meet_full();
		var td = document.getElementById(id) ;
		str = "" ;
		str = str + "ตามมติที่ประชุมตามมติที่ประชุม ครั้งที่  ...../2558 เมื่อวันที่ ........... ";
		str = str + " เห็นสมควรจำหน่ายทรัพย์สินประเภทลูกหนี้ออกจากบัญชีเป็นหนี้สูญ เนื่องจาก";
		str = str + "<br>1. มีหลักฐานการเป็นหนี้ฟ้องคดีได้";
		str = str + "<br>2. เป็นหนี้ไม่ขาดอายุความ";
		str = str + "<br>3. สำรองหนี้เต็มมูลค่าแล้ว";
		str = str + "<br>4. มีการติดตามหนี้ถึงที่สุด ไม่มีลู่ทางชำระหนี้";
		str = str + "<br>5 .ทรัพย์สินมีไม่เพียงพอที่จะดำเนินคดี  หากฟ้องร้องดำเนินคดี  จะไม่คุ้มค่าใช้จ่าย";
		str = str + "<br>6. บุคคลค้ำไม่มีศักยภาพชำระหนี้แทนผู้กู้ได้";
		str = str + "<br><br>";
		td.innerHTML = str ;
}	

// สร้างความเห็นสาขา
function f_cal_4_3(){
		f_meet_full();
		
		var str = document.getElementById("tab1_meet_full").innerText ;
		str = str + " เห็นสมควรจำหน่ายทรัพย์สินประเภทลูกหนี้ออกจากบัญชีเป็นหนี้สูญเนื่องจาก";
		str = str + " เป็นหนี้ไม่ขาดอายุความ";
		str = str + " มีหลักฐานการเป็นหนี้พอฟ้องคดีได้ มีการติดตามหนี้ถึงที่สุด ไม่มีลู่ทางชำระหนี้ได้ ";
		str = str + " ไม่ฟ้องหรือดำเนินคดีเนื่องจากหากจะฟ้องผู้กู้และลูกหนี้ร่วม/ผู้ค้ำประกัน";
		str = str + " ผู้กู้ไม่มีทรัพย์สิน  ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย";
		str = str + " ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย";
		
		
		var follow_cus = document.getElementById("tab4_1").innerHTML ;
		var follow_garan = document.getElementById("tab4_2").innerHTML ;
		
		str = str + "<br><br><div style='font-weight:bold;'>การติดตามหนี้ลูกค้า</div>" +  follow_cus  ;
 		str = str + "<br><br><div style='font-weight:bold;'>การติดตามหนี้ลูกหนี้ร่วมและหรือผู้ค้ำประกัน</div>" +  follow_garan  ; 
		
		document.getElementById("tab4_3").innerHTML = str ;

		
	
}

//********************************************************************
// ลบข้อมูล
//********************************************************************
function f_del_data_all_tab(){
		if (confirm("- - - - - - - - - - - - - - - - - - - - - - - - - -\n ต้องการ ลบข้อมูล หรือไม่ ? ")) {
				// continue				
				} else {
				return  false ;  
				// exit
		}
	 

		f_del_data_tab1_456();
		
		f_del_data_tab2();
		f_del_data_tab3();
		
		document.getElementById("tab4_1").innerText = "" ;
		document.getElementById("tab4_2").innerText = "" ;
		document.getElementById("tab4_3").innerText = "" ;
		document.getElementById("tab4_4").innerText = "" ;
		
}

function f_del_data_tab1_456(){

	 document.getElementById("tab1_name").innerText = "" ;
	 document.getElementById("tab1_age").innerText = "" ;
	 document.getElementById("tab1_cid").innerText = "" ;
	 document.getElementById("tab1_group").innerText = "" ;
	 document.getElementById("tab1_cif").innerText = "" ;
	 
	 document.getElementById("tab1_status").innerText = "" ;
	 document.getElementById("tab1_debt_servant").innerText = "" ;
	 document.getElementById("tab1_job").innerText = "" ;
	 document.getElementById("tab1_income").innerText = "" ;
	 document.getElementById("tab1_asset").innerText = "" ;	
	 document.getElementById("tab1_npl_year").innerText = "" ;	

	 f_table_delete_all_row("tb_loan",2);

	 document.getElementById("tab1_name").focus(); 
}

function f_del_data_tab2(){
	 document.getElementById("tab2_1_3").innerText = "" ;
	 document.getElementById("tab2_1_4").innerText = "" ;
	 document.getElementById("tab2_1_5").innerText = "" ;
	 document.getElementById("tab2_2_1").innerText = "" ;
	 document.getElementById("tab2_2_2").innerText = "" ;
	 document.getElementById("tab2_3_1").innerText = "" ;
	 document.getElementById("tab2_3_2").innerText = "" ;
	 document.getElementById("tab2_3_3").innerText = "" ;	
}

function f_del_data_tab3(){
	f_table_delete_all_row("tb_garantee");	
}	