<?php
header('Content-Type: text/html; charset=utf-8');
?>

<!DOCTYPE html>
<html>
<head>

<script>
function autoTab(e) {
    var pattern = new String("_-____-_____-__-_"); // กำหนดรูปแบบในนี้
    var pattern_ex = new String("-"); // กำหนดสัญลักษณ์หรือเครื่องหมายที่ใช้แบ่งในนี้
    var returnText = new String("");
    var obj_l =e.value.length;
    var obj_l2 = obj_l - 1;
    for (i = 0; i < pattern.length; i++) {
        if (obj_l2 == i && pattern.charAt(i + 1) == pattern_ex) {
            returnText +=e.value + pattern_ex;
           e.value = returnText;
        }
    }
   // if (obj_l >= pattern.length) {
       e.value =e.value.substr(0, pattern.length);
    //}
}

</script>
</head>
<body>
<p>กรอกเลขบ้ตรประชาชน(ไม่ต้องมีขีด)</p>

        <input type="text" 
				tabindex="1"   
				name="reg_id_card" 
				id="username" size="25" value="" 
				class="inputbox autowidth"  
				onkeyup="autoTab(this);"  

				minlength="13" maxlength="20" />

</body>
</html>



<?php
header("Content-Type: text/html; charset=utf-8");
date_default_timezone_set('Asia/Bangkok');
$today = date("D d F Y H:i:s"); 


require_once '../Classes/PHPWord.php';

$PHPWord = new PHPWord();

$document = $PHPWord->loadTemplate('writeoff_template.docx');


// วางค่าตามลำดับของตัวแปร
$cif = "9993319" ;
$document->setValue('acc_year', '2566/67');
$document->setValue('customer_name', 'นายจอง ราชกระโทก อายุ 80 ปี เลขบัตรประชาชน 11111-1111111-1  สาขาปะคำ  สังกัด สนจ.บุรีรัมย์ กลุ่ม ปค.148 เลขทะเบียน' .  $cif );
$document->setValue("rai", "55");



$row = 3 ;
$document->cloneRow('col1', $row);

$str1 = "1)เงินทุนหมุนเวียน \r\n 536138054318 \r\n ลว.18 ม.ค. 2539|ลน.ร่วม,คนค้ำ|18,000.00|-|-|-|-|-|-|-|18,000.00|20,005.01|19" ;
$str2 = "1)เงินทุนหมุนเวียน \r\n 536138888888 \r\n ลว.18 ม.ค. 2539|ลน.ร่วม,คนค้ำ|10,000.00|-|-|-|-|-|-|-|10,000.00|10,005.02|19" ;
$str3 = "รวม|xxx|28,000.00|-|-|-|-|-|-|-|28,000.00|30,010.03|19" ;

f_row($document,$str1,1);
f_row($document,$str2,2);
f_row($document,$str3,3);

function f_row($document,$str,$row){
	$cols = explode("|" , $str) ;
	$max = count($cols) ;
	for ($i=0  ; $i < $max; $i++) {
				$var = "col".$i."#".$row  ;
				$str = $cols[$i] ;
				$str = str_replace("@",chr(13) . Chr(10), $str) ;
				$str = str_replace("@",chr(13) . Chr(10), $str) ;
				$document->setValue($var,$str);
	}
}

$document->setValue('1_loan_status', 'เป็นหนี้ยังไม่ดำเนินคดี มีหลักฐานการเป็นหนี้ครบถ้วนพอฟ้องคดีได้ ไม่ขาดอายุความเนื่องจากตย.2) ทําบันทึกข้อตกลง ต่อท้ายพักชําระหนี้ 22 กันยายน 2544 และชำระบางส่วนทั้งสองสัญญาเมื่อวันที่ 21 ธันวาคม 2557 (เงินจาก ฌาปนกิจสงเคราะห์) ตย.3) จากชําระหนี้ 11 มีนาคม 2535,3 กันยายน 2539, 11 สิงหาคม 2540 ทํารชน.(ตนเอง) 10กันยายน 2556 และชำระบางส่วนทั้งสองสัญญาเมื่อวันที่ 21 ธันวาคม 2557 (เงิน ฌาปนกิจสงเคราะห์) ตย.3กรณีตาย) ผู้อื่น รชน.เมื่อ 11 กันยายน 2557 ไม่ดำเนินคดีเนื่องจากผู้กู้ไม่มีทรัพย์สิน  ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย ลูกหนี้ร่วมและผู้ค้ำประกันมีทรัพย์สิน ซึ่งไม่คุ้มกับค่าใช้จ่าย หากจะฟ้องผู้กู้และลูกหนี้ร่วม/ผู้ค้ำประกัน');
$document->setValue('2_npl_cause', 'ปี 2540-2541 กู้เงินเพื่อเป็นค่าใช้จ่ายในการทำนาเช่า 16 ไร่และซื้อวัวแม่พันธุ์ 5 ตัว   ตย.2) เป็นหนี้ซึ่งเกิดจากการรับใช้หนี้แทนบิดา ที่ตาย ซึ่งกู้เงินปี 2540-2541เพื่อทํานาข้าว ชำระหนี้ไม่ได้เนื่องจากตย1) ประสบภาวะฝนแล้งติดต่อกันหลายปี ได้ขายวัวชำระหนี้บางส่วน ที่เหลือนำเงินมาเป็นค่าใช้จ่ายในครอบครัว  ต่อมาธนาคารให้การช่วยเหลือโดย ปรับปรุงโครงสร้างหนี้ แต่ชำระหนี้ไม่ได้เนื่องจากคู่สมรสเสียชีวิตโดยไม่ได้สมัครสมาคมฌาปนกิจฯ มีค่าใช้จ่ายสูง ตย2) : กรณี รชน : คีย์เข้าระบบแล้ว.) แต่ประสบปัญหามีค่ารักษาพยาบาลตนเองซึ่งป่วยเป็นโรคมะเร็ง ส่วนผู้รับใช้หนี้เข้าทํารับใช้หนี้ขณะเลิกประกอบอาชีพการเกษตรทําให้ ไม่มีรายได้พอชําระหนี้ได้');
$document->setValue('3_customer_status', 'ตย.1) ป่วยด้วยอาการปวดมือและขาขวา จากการผ่าตัดใส่เหล็กดาม เนื่องจากอุบัติเหตุถูกรถชนต้องกินยาแก้ปวดทุกวัน ตย.2) เป็นสมาชิกกองทุนฟื้นฟู กลุ่ม 1 เสียชีวิตเมื่อวันที่ 8 กันยายน 2553 ด้วยโรคหอบหืด << กรณีตายให้ระบุปีที่ตายด้วย >> คู่สมรส อายุ 74 ปี ชราภาพ ตย.1) มีอาชีพรับจ้างทั่วไปรายวัน รายได้พอยังชีพ ตย.2) เลิกประกอบอาชีพ อาศัยอยู่กับลูก (กรณีนี้ส่วนใหญ่ อายุมากหรือป่วย ในรายการทรัพย์สิน : ไม่มีทรัพย์สิน อาศัยอยู่กับลูก) ตย.1) บ้าน 1 หลัง ไม่มีมูลค่า ปลูกในที่ไม่มีเอกสารสิทธิ์ ตย.2) ไม่มีทรัพย์สิน อาศัยอยู่กับลูก ตย.3) บ้าน 1 หลัง ไม่มีมูลค่า ปลูกในที่ของผู้อื่น');


 
 
$document->saveAs("out/164_cif(". $cif.").docx");
echo "writeoff_out.docx<hr>";
echo $today ;